package com.pingwit.part_20.point_1;
@SuppressWarnings("SpellCheckingInspection")
public class GenericTheory {
    public static void main(String[] args) {
        /*
        Generics (обобщения)
        В своей основе термин Generics означает параметризованные типы.
        Параметризованные типы важны, поскольку они позволяют создавать классы, интерфейсы и методы,
        где тип данных, с которым они работают, указывается в качестве параметра.
        Например, с использованием обобщений можно создать единственный класс,
        который автоматически работает с разными типами данных.
        Класс, интерфейс или метод, который оперирует на параметризованном типе, называется обобщенным.


        Основные характеристики:
        - Generics появились в JDK 5
        - Generics нету в рантайме.
        - Благодаря использованию обобщений можно создавать классы, интерфейсы и методы, которые будут безопасно работать с разнообразными типами данных.
        - В основном используются в коллекциях, это своего рода универсальные хранилища данных с очень удобным взаимодействием
         */
    }
}
